www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205835.c
#define HRTIM_FLTINR2_FLTxLCK                                                  \
  ((HRTIM_FAULTLOCK_READONLY) | (HRTIM_FAULTLOCK_READONLY << 8U))
/**
 * @}
 */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup HRTIM_Private_Variables HRTIM Private Variables
 * @{
 */
static uint32_t TimerIdxToTimerId[] = {
    HRTIM_TIMERID_TIMER_A, HRTIM_TIMERID_TIMER_B, HRTIM_TIMERID_TIMER_C,
    HRTIM_TIMERID_TIMER_D, HRTIM_TIMERID_TIMER_E, HRTIM_TIMERID_MASTER,
};
/**
 * @}
 */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup HRTIM_Private_Functions HRTIM Private Functions
 * @{
 */
static void
HRTIM_MasterBase_Config(HRTIM_HandleTypeDef *hhrtim,
                        const HRTIM_TimeBaseCfgTypeDef *pTimeBaseCfg);

static void
HRTIM_TimingUnitBase_Config(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                            const HRTIM_TimeBaseCfgTypeDef *pTimeBaseCfg);

static void HRTIM_MasterWaveform_Config(HRTIM_HandleTypeDef *hhrtim,
                                        const HRTIM_TimerCfgTypeDef *pTimerCfg);

static void
HRTIM_TimingUnitWaveform_Config(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                                const HRTIM_TimerCfgTypeDef *pTimerCfg);

static void HRTIM_CaptureUnitConfig(HRTIM_HandleTypeDef *hhrtim,
                                    uint32_t TimerIdx, uint32_t CaptureUnit,
                                    uint32_t Event);

static void HRTIM_OutputConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                               uint32_t Output,
                               const HRTIM_OutputCfgTypeDef *pOutputCfg);

static void HRTIM_EventConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t Event,
                              const HRTIM_EventCfgTypeDef *pEventCfg);

static void HRTIM_TIM_ResetConfig(HRTIM_HandleTypeDef *hhrtim,
                                  uint32_t TimerIdx, uint32_t Event);

static uint32_t HRTIM_GetITFromOCMode(const HRTIM_HandleTypeDef *hhrtim,
                                      uint32_t TimerIdx, uint32_t OCChannel);

static uint32_t HRTIM_GetDMAFromOCMode(const HRTIM_HandleTypeDef *hhrtim,
                                       uint32_t TimerIdx, uint32_t OCChannel);

static DMA_HandleTypeDef *
HRTIM_GetDMAHandleFromTimerIdx(const HRTIM_HandleTypeDef *hhrtim,
                               uint32_t TimerIdx);

static uint32_t GetTimerIdxFromDMAHandle(const HRTIM_HandleTypeDef *hhrtim,
                                         const DMA_HandleTypeDef *hdma);

static void HRTIM_ForceRegistersUpdate(HRTIM_HandleTypeDef *hhrtim,
                                       uint32_t TimerIdx);

static void HRTIM_HRTIM_ISR(HRTIM_HandleTypeDef *hhrtim);

static void HRTIM_Master_ISR(HRTIM_HandleTypeDef *hhrtim);

static void HRTIM_Timer_ISR(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx);

static void HRTIM_DMAMasterCplt(DMA_HandleTypeDef *hdma);

static void HRTIM_DMATimerxCplt(DMA_HandleTypeDef *hdma);

static void HRTIM_DMAError(DMA_HandleTypeDef *hdma);

static void HRTIM_BurstDMACplt(DMA_HandleTypeDef *hdma);
/**
 * @}
 */

/* Exported functions
 * ---------------------------------------------------------*/
/** @defgroup HRTIM_Exported_Functions HRTIM Exported Functions
 * @{
 */

/** @defgroup HRTIM_Exported_Functions_Group1 Initialization and
de-initialization functions
 *  @brief    Initialization and Configuration functions
@verbatim
 ===============================================================================
              ##### Initialization and Time Base Configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize a HRTIM instance
      (+) De-initialize a HRTIM instance
      (+) Initialize the HRTIM MSP
      (+) De-initialize the HRTIM MSP
      (+) Start the high-resolution unit (start DLL calibration)
      (+) Check that the high resolution unit is ready (DLL calibration done)
      (+) Configure the time base unit of a HRTIM timer

@endverbatim
  * @{
  */

/**
 * @brief  Initialize a HRTIM instance
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_Init(HRTIM_HandleTypeDef *hhrtim) {
  uint8_t timer_idx;
  uint32_t hrtim_mcr;

  /* Check the HRTIM handle allocation */
  if (hhrtim == NULL) {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_HRTIM_ALL_INSTANCE(hhrtim->Instance));
  assert_param(IS_HRTIM_IT(hhrtim->Init.HRTIMInterruptResquests));

#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
  if (hhrtim->State == HAL_HRTIM_STATE_RESET) {
    /* Initialize callback function pointers to their default values */
    hhrtim->Fault1Callback = HAL_HRTIM_Fault1Callback;
    hhrtim->Fault2Callback = HAL_HRTIM_Fault2Callback;
    hhrtim->Fault3Callback = HAL_HRTIM_Fault3Callback;
    hhrtim->Fault4Callback = HAL_HRTIM_Fault4Callback;
    hhrtim->Fault5Callback = HAL_HRTIM_Fault5Callback;
    hhrtim->SystemFaultCallback = HAL_HRTIM_SystemFaultCallback;
    hhrtim->DLLCalibrationReadyCallback = HAL_HRTIM_DLLCalibrationReadyCallback;
    hhrtim->BurstModePeriodCallback = HAL_HRTIM_BurstModePeriodCallback;
    hhrtim->SynchronizationEventCallback =
        HAL_HRTIM_SynchronizationEventCallback;
    hhrtim->ErrorCallback = HAL_HRTIM_ErrorCallback;
    hhrtim->RegistersUpdateCallback = HAL_HRTIM_RegistersUpdateCallback;
    hhrtim->RepetitionEventCallback = HAL_HRTIM_RepetitionEventCallback;
    hhrtim->Compare1EventCallback = HAL_HRTIM_Compare1EventCallback;
    hhrtim->Compare2EventCallback = HAL_HRTIM_Compare2EventCallback;
    hhrtim->Compare3EventCallback = HAL_HRTIM_Compare3EventCallback;
    hhrtim->Compare4EventCallback = HAL_HRTIM_Compare4EventCallback;
    hhrtim->Capture1EventCallback = HAL_HRTIM_Capture1EventCallback;
    hhrtim->Capture2EventCallback = HAL_HRTIM_Capture2EventCallback;
    hhrtim->DelayedProtectionCallback = HAL_HRTIM_DelayedProtectionCallback;
    hhrtim->CounterResetCallback = HAL_HRTIM_CounterResetCallback;
    hhrtim->Output1SetCallback = HAL_HRTIM_Output1SetCallback;
    hhrtim->Output1ResetCallback = HAL_HRTIM_Output1ResetCallback;
    hhrtim->Output2SetCallback = HAL_HRTIM_Output2SetCallback;
    hhrtim->Output2ResetCallback = HAL_HRTIM_Output2ResetCallback;
    hhrtim->BurstDMATransferCallback = HAL_HRTIM_BurstDMATransferCallback;

    if (hhrtim->MspInitCallback == NULL) {
      hhrtim->MspInitCallback = HAL_HRTIM_MspInit;
    }
  }
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */

  /* Set the HRTIM state */
  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Initialize the DMA handles */
  hhrtim->hdmaMaster = (DMA_HandleTypeDef *)NULL;
  hhrtim->hdmaTimerA = (DMA_HandleTypeDef *)NULL;
  hhrtim->hdmaTimerB = (DMA_HandleTypeDef *)NULL;
  hhrtim->hdmaTimerC = (DMA_HandleTypeDef *)NULL;
  hhrtim->hdmaTimerD = (DMA_HandleTypeDef *)NULL;
  hhrtim->hdmaTimerE = (DMA_HandleTypeDef *)NULL;

