www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205835.c
  /* Enable the timer repetition DMA request */
  if (TimerIdx == HRTIM_TIMERINDEX_MASTER) {
    __HAL_HRTIM_MASTER_ENABLE_DMA(hhrtim, HRTIM_MASTER_DMA_MREP);
  } else {
    __HAL_HRTIM_TIMER_ENABLE_DMA(hhrtim, TimerIdx, HRTIM_TIM_DMA_REP);
  }

  /* Enable the timer counter */
  __HAL_HRTIM_ENABLE(hhrtim, TimerIdxToTimerId[TimerIdx]);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Stop the counter of a timer operating in simple time base mode
 *         (Timer repetition DMA request is disabled).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index.
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_SimpleBaseStop_DMA(HRTIM_HandleTypeDef *hhrtim,
                                               uint32_t TimerIdx) {
  DMA_HandleTypeDef *hdma;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERINDEX(TimerIdx));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  if (TimerIdx == HRTIM_TIMERINDEX_MASTER) {
    hhrtim->State = HAL_HRTIM_STATE_READY;

    /* Disable the DMA */
    if (HAL_DMA_Abort(hhrtim->hdmaMaster) != HAL_OK) {
      hhrtim->State = HAL_HRTIM_STATE_ERROR;
    }
    /* Disable the timer repetition DMA request */
    __HAL_HRTIM_MASTER_DISABLE_DMA(hhrtim, HRTIM_MASTER_DMA_MREP);
  } else {
    /* Get the timer DMA handler */
    hdma = HRTIM_GetDMAHandleFromTimerIdx(hhrtim, TimerIdx);

    if (hdma == NULL) {
      hhrtim->State = HAL_HRTIM_STATE_ERROR;
    } else {
      hhrtim->State = HAL_HRTIM_STATE_READY;

      /* Disable the DMA */
      if (HAL_DMA_Abort(hdma) != HAL_OK) {
        hhrtim->State = HAL_HRTIM_STATE_ERROR;
      }

      /* Disable the timer repetition DMA request */
      __HAL_HRTIM_TIMER_DISABLE_DMA(hhrtim, TimerIdx, HRTIM_TIM_DMA_REP);
    }
  }

  /* Disable the timer counter */
  __HAL_HRTIM_DISABLE(hhrtim, TimerIdxToTimerId[TimerIdx]);

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  } else {
    return HAL_OK;
  }
}

/**
 * @}
 */

/** @defgroup HRTIM_Exported_Functions_Group3 Simple output compare mode
functions
 *  @brief    Simple output compare functions
@verbatim
 ===============================================================================
              ##### Simple output compare functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure simple output channel
      (+) Start simple output compare
      (+) Stop simple output compare
      (+) Start simple output compare and enable interrupt
      (+) Stop simple output compare and disable interrupt
      (+) Start simple output compare and enable DMA transfer
      (+) Stop simple output compare and disable DMA transfer
       -@- When a HRTIM timer operates in simple output compare mode
           the output level is set to a programmable value when a match
           is found between the compare register and the counter.
           Compare unit 1 is automatically associated to output 1
           Compare unit 2 is automatically associated to output 2
@endverbatim
  * @{
  */

/**
 * @brief  Configure an output in simple output compare mode
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  OCChannel Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @param  pSimpleOCChannelCfg pointer to the simple output compare output
 * configuration structure
 * @note When the timer operates in simple output compare mode:
 *         Output 1 is implicitly controlled by the compare unit 1
 *         Output 2 is implicitly controlled by the compare unit 2
 *       Output Set/Reset crossbar is set according to the selected output
 * compare mode: Toggle: SETxyR = RSTxyR = CMPy Active: SETxyR = CMPy, RSTxyR =
 * 0 Inactive: SETxy =0, RSTxy = CMPy
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_SimpleOCChannelConfig(
    HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx, uint32_t OCChannel,
    const HRTIM_SimpleOCChannelCfgTypeDef *pSimpleOCChannelCfg) {
  uint32_t CompareUnit = (uint32_t)RESET;
  HRTIM_OutputCfgTypeDef OutputCfg;

  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, OCChannel));
  assert_param(IS_HRTIM_BASICOCMODE(pSimpleOCChannelCfg->Mode));
  assert_param(IS_HRTIM_OUTPUTPULSE(pSimpleOCChannelCfg->Pulse));
  assert_param(IS_HRTIM_OUTPUTPOLARITY(pSimpleOCChannelCfg->Polarity));
  assert_param(IS_HRTIM_OUTPUTIDLELEVEL(pSimpleOCChannelCfg->IdleLevel));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

