www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205835.c
      /* Enable the timer DMA request */
      __HAL_HRTIM_TIMER_ENABLE_DMA(hhrtim, timer_idx,
                                   hhrtim->TimerParam[timer_idx].DMARequests);
    }
  }

  /* Enable the timer counter */
  __HAL_HRTIM_ENABLE(hhrtim, Timers);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Stop the counter of the designated timer(s) operating in waveform
 * mode Timers can be combined (ORed) to allow for simultaneous counter stop.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer counter(s) to stop
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERID_MASTER
 *                   @arg HRTIM_TIMERID_TIMER_A
 *                   @arg HRTIM_TIMERID_TIMER_B
 *                   @arg HRTIM_TIMERID_TIMER_C
 *                   @arg HRTIM_TIMERID_TIMER_D
 *                   @arg HRTIM_TIMERID_TIMER_E
 * @retval HAL status
 * @note  The counter of a timer is stopped only if all timer outputs are
 * disabled
 * @note  All enabled timer related DMA requests are disabled.
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformCountStop_DMA(HRTIM_HandleTypeDef *hhrtim,
                                                  uint32_t Timers) {
  uint8_t timer_idx;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERID(Timers));

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  if (((Timers & HRTIM_TIMERID_MASTER) != 0U) &&
      (hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].DMARequests != 0U)) {
    /* Disable the DMA */
    if (HAL_DMA_Abort(hhrtim->hdmaMaster) != HAL_OK) {
      hhrtim->State = HAL_HRTIM_STATE_ERROR;
    } else {
      hhrtim->State = HAL_HRTIM_STATE_READY;
      /* Disable the DMA request(s) */
      __HAL_HRTIM_MASTER_DISABLE_DMA(
          hhrtim, hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].DMARequests);
    }
  }

  for (timer_idx = HRTIM_TIMERINDEX_TIMER_A;
       timer_idx < HRTIM_TIMERINDEX_MASTER; timer_idx++) {
    if (((Timers & TimerIdxToTimerId[timer_idx]) != 0U) &&
        (hhrtim->TimerParam[timer_idx].DMARequests != 0U)) {
      /* Get the timer DMA handler */
      /* Disable the DMA */
      if (HAL_DMA_Abort(HRTIM_GetDMAHandleFromTimerIdx(hhrtim, timer_idx)) !=
          HAL_OK) {
        hhrtim->State = HAL_HRTIM_STATE_ERROR;
      } else {
        hhrtim->State = HAL_HRTIM_STATE_READY;

        /* Disable the DMA request(s) */
        __HAL_HRTIM_TIMER_DISABLE_DMA(
            hhrtim, timer_idx, hhrtim->TimerParam[timer_idx].DMARequests);
      }
    }
  }

  /* Disable the timer counter */
  __HAL_HRTIM_DISABLE(hhrtim, Timers);

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  } else {
    return HAL_OK;
  }
}

/**
 * @brief  Enable or disables the HRTIM burst mode controller.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Enable Burst mode controller enabling
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_BURSTMODECTL_ENABLED: Burst mode enabled
 *                    @arg HRTIM_BURSTMODECTL_DISABLED: Burst mode disabled
 * @retval HAL status
 * @note This function must be called after starting the timer(s)
 */
HAL_StatusTypeDef HAL_HRTIM_BurstModeCtl(HRTIM_HandleTypeDef *hhrtim,
                                         uint32_t Enable) {
  /* Check parameters */
  assert_param(IS_HRTIM_BURSTMODECTL(Enable));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Enable/Disable the burst mode controller */
  MODIFY_REG(hhrtim->Instance->sCommonRegs.BMCR, HRTIM_BMCR_BME, Enable);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Trig the burst mode operation.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_HRTIM_BurstModeSoftwareTrigger(HRTIM_HandleTypeDef *hhrtim) {
  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Software trigger of the burst mode controller */
  SET_BIT(hhrtim->Instance->sCommonRegs.BMTRGR, HRTIM_BMTRGR_SW);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Trig a software capture on the designed capture unit
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  CaptureUnit Capture unit to trig
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_CAPTUREUNIT_1: Capture unit 1
 *                    @arg HRTIM_CAPTUREUNIT_2: Capture unit 2
 * @retval HAL status
 * @note The 'software capture' bit in the capure configuration register is
 *       automatically reset by hardware
 */
HAL_StatusTypeDef HAL_HRTIM_SoftwareCapture(HRTIM_HandleTypeDef *hhrtim,
                                            uint32_t TimerIdx,
                                            uint32_t CaptureUnit) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));
  assert_param(IS_HRTIM_CAPTUREUNIT(CaptureUnit));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

