www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205835.c
  case HRTIM_TIMERINDEX_TIMER_B: {
    hrtim_bmcr &= ~(HRTIM_BMCR_TBBM);
    hrtim_bmcr |= (pTimerCfg->BurstMode << 2U);
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_C: {
    hrtim_bmcr &= ~(HRTIM_BMCR_TCBM);
    hrtim_bmcr |= (pTimerCfg->BurstMode << 3U);
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_D: {
    hrtim_bmcr &= ~(HRTIM_BMCR_TDBM);
    hrtim_bmcr |= (pTimerCfg->BurstMode << 4U);
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_E: {
    hrtim_bmcr &= ~(HRTIM_BMCR_TEBM);
    hrtim_bmcr |= (pTimerCfg->BurstMode << 5U);
    break;
  }

  default:
    break;
  }

  /* Update the HRTIM registers */
  hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxCR = hrtim_timcr;
  hhrtim->Instance->sTimerxRegs[TimerIdx].FLTxR = hrtim_timfltr;
  hhrtim->Instance->sTimerxRegs[TimerIdx].OUTxR = hrtim_timoutr;
  hhrtim->Instance->sTimerxRegs[TimerIdx].RSTxR = hrtim_timrstr;
  hhrtim->Instance->sCommonRegs.BMCR = hrtim_bmcr;
}

/**
 * @brief  Configure a capture unit
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 * @param  CaptureUnit Capture unit identifier
 * @param  Event Event reference
 * @retval None
 */
static void HRTIM_CaptureUnitConfig(HRTIM_HandleTypeDef *hhrtim,
                                    uint32_t TimerIdx, uint32_t CaptureUnit,
                                    uint32_t Event) {
  uint32_t CaptureTrigger = 0xFFFFFFFFU;

  switch (Event) {
  case HRTIM_EVENT_1: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_1;
    break;
  }

  case HRTIM_EVENT_2: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_2;
    break;
  }

  case HRTIM_EVENT_3: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_3;
    break;
  }

  case HRTIM_EVENT_4: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_4;
    break;
  }

  case HRTIM_EVENT_5: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_5;
    break;
  }

  case HRTIM_EVENT_6: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_6;
    break;
  }

  case HRTIM_EVENT_7: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_7;
    break;
  }

  case HRTIM_EVENT_8: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_8;
    break;
  }

  case HRTIM_EVENT_9: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_9;
    break;
  }

  case HRTIM_EVENT_10: {
    CaptureTrigger = HRTIM_CAPTURETRIGGER_EEV_10;
    break;
  }

  default:
    break;
  }

  switch (CaptureUnit) {
  case HRTIM_CAPTUREUNIT_1: {
    hhrtim->TimerParam[TimerIdx].CaptureTrigger1 = CaptureTrigger;
    break;
  }

  case HRTIM_CAPTUREUNIT_2: {
    hhrtim->TimerParam[TimerIdx].CaptureTrigger2 = CaptureTrigger;
    break;
  }

  default:
    break;
  }
}

/**
 * @brief  Configure the output of a timing unit
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 * @param  Output timing unit output identifier
 * @param  pOutputCfg pointer to the output configuration data structure
 * @retval None
 */
static void HRTIM_OutputConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                               uint32_t Output,
                               const HRTIM_OutputCfgTypeDef *pOutputCfg) {
  uint32_t hrtim_outr;
  uint32_t hrtim_dtr;

  uint32_t shift = 0U;

  hrtim_outr = hhrtim->Instance->sTimerxRegs[TimerIdx].OUTxR;
  hrtim_dtr = hhrtim->Instance->sTimerxRegs[TimerIdx].DTxR;

  switch (Output) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    /* Set the output set/reset crossbar */
    hhrtim->Instance->sTimerxRegs[TimerIdx].SETx1R = pOutputCfg->SetSource;
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx1R = pOutputCfg->ResetSource;
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    /* Set the output set/reset crossbar */
    hhrtim->Instance->sTimerxRegs[TimerIdx].SETx2R = pOutputCfg->SetSource;
    hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx2R = pOutputCfg->ResetSource;
    shift = 16U;
    break;
  }

  default:
    break;
  }

  /* Clear output config */
  hrtim_outr &= ~((HRTIM_OUTR_POL1 | HRTIM_OUTR_IDLM1 | HRTIM_OUTR_IDLES1 |
                   HRTIM_OUTR_FAULT1 | HRTIM_OUTR_CHP1 | HRTIM_OUTR_DIDL1)
                  << shift);

  /* Set the polarity */
  hrtim_outr |= (pOutputCfg->Polarity << shift);

  /* Set the IDLE mode */
  hrtim_outr |= (pOutputCfg->IdleMode << shift);

  /* Set the IDLE state */
  hrtim_outr |= (pOutputCfg->IdleLevel << shift);

  /* Set the FAULT state */
  hrtim_outr |= (pOutputCfg->FaultLevel << shift);

  /* Set the chopper mode */
  hrtim_outr |= (pOutputCfg->ChopperModeEnable << shift);

  /* Set the burst mode entry mode : deadtime insertion when entering the idle
     state during a burst mode operation is allowed only under the following
     conditions:
     - the outputs is active during the burst mode (IDLES=1U)
     - positive deadtimes (SDTR/SDTF set to 0U)
  */
  if ((pOutputCfg->IdleLevel == HRTIM_OUTPUTIDLELEVEL_ACTIVE) &&
      ((hrtim_dtr & HRTIM_DTR_SDTR) == (uint32_t)RESET) &&
      ((hrtim_dtr & HRTIM_DTR_SDTF) == (uint32_t)RESET)) {
    hrtim_outr |= (pOutputCfg->BurstModeEntryDelayed << shift);
  }

  /* Update HRTIM register */
  hhrtim->Instance->sTimerxRegs[TimerIdx].OUTxR = hrtim_outr;
}

/**
 * @brief  Configure an external event channel
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Event Event channel identifier
 * @param  pEventCfg pointer to the event channel configuration data structure
 * @retval None
 */
static void HRTIM_EventConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t Event,
                              const HRTIM_EventCfgTypeDef *pEventCfg) {
  uint32_t hrtim_eecr1;
  uint32_t hrtim_eecr2;
  uint32_t hrtim_eecr3;

  /* Configure external event channel */
  hrtim_eecr1 = hhrtim->Instance->sCommonRegs.EECR1;
  hrtim_eecr2 = hhrtim->Instance->sCommonRegs.EECR2;
  hrtim_eecr3 = hhrtim->Instance->sCommonRegs.EECR3;

  switch (Event) {
  case HRTIM_EVENT_NONE: {
    /* Update the HRTIM registers */
    hhrtim->Instance->sCommonRegs.EECR1 = 0U;
    hhrtim->Instance->sCommonRegs.EECR2 = 0U;
    hhrtim->Instance->sCommonRegs.EECR3 = 0U;
    break;
  }

  case HRTIM_EVENT_1: {
    hrtim_eecr1 &= ~(HRTIM_EECR1_EE1SRC | HRTIM_EECR1_EE1POL |
                     HRTIM_EECR1_EE1SNS | HRTIM_EECR1_EE1FAST);
    hrtim_eecr1 |= (pEventCfg->Source & HRTIM_EECR1_EE1SRC);
    hrtim_eecr1 |= (pEventCfg->Polarity & HRTIM_EECR1_EE1POL);
    hrtim_eecr1 |= (pEventCfg->Sensitivity & HRTIM_EECR1_EE1SNS);
    /* Update the HRTIM registers (all bitfields but EE1FAST bit) */
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    /* Update the HRTIM registers (EE1FAST bit) */
    hrtim_eecr1 |= (pEventCfg->FastMode & HRTIM_EECR1_EE1FAST);
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    break;
  }

  case HRTIM_EVENT_2: {
    hrtim_eecr1 &= ~(HRTIM_EECR1_EE2SRC | HRTIM_EECR1_EE2POL |
                     HRTIM_EECR1_EE2SNS | HRTIM_EECR1_EE2FAST);
    hrtim_eecr1 |= ((pEventCfg->Source << 6U) & HRTIM_EECR1_EE2SRC);
    hrtim_eecr1 |= ((pEventCfg->Polarity << 6U) & HRTIM_EECR1_EE2POL);
    hrtim_eecr1 |= ((pEventCfg->Sensitivity << 6U) & HRTIM_EECR1_EE2SNS);
    /* Update the HRTIM registers (all bitfields but EE2FAST bit) */
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    /* Update the HRTIM registers (EE2FAST bit) */
    hrtim_eecr1 |= ((pEventCfg->FastMode << 6U) & HRTIM_EECR1_EE2FAST);
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    break;
  }

  case HRTIM_EVENT_3: {
    hrtim_eecr1 &= ~(HRTIM_EECR1_EE3SRC | HRTIM_EECR1_EE3POL |
                     HRTIM_EECR1_EE3SNS | HRTIM_EECR1_EE3FAST);
    hrtim_eecr1 |= ((pEventCfg->Source << 12U) & HRTIM_EECR1_EE3SRC);
    hrtim_eecr1 |= ((pEventCfg->Polarity << 12U) & HRTIM_EECR1_EE3POL);
    hrtim_eecr1 |= ((pEventCfg->Sensitivity << 12U) & HRTIM_EECR1_EE3SNS);
    /* Update the HRTIM registers (all bitfields but EE3FAST bit) */
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    /* Update the HRTIM registers (EE3FAST bit) */
    hrtim_eecr1 |= ((pEventCfg->FastMode << 12U) & HRTIM_EECR1_EE3FAST);
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    break;
  }

  case HRTIM_EVENT_4: {
    hrtim_eecr1 &= ~(HRTIM_EECR1_EE4SRC | HRTIM_EECR1_EE4POL |
                     HRTIM_EECR1_EE4SNS | HRTIM_EECR1_EE4FAST);
    hrtim_eecr1 |= ((pEventCfg->Source << 18U) & HRTIM_EECR1_EE4SRC);
    hrtim_eecr1 |= ((pEventCfg->Polarity << 18U) & HRTIM_EECR1_EE4POL);
    hrtim_eecr1 |= ((pEventCfg->Sensitivity << 18U) & HRTIM_EECR1_EE4SNS);
    /* Update the HRTIM registers (all bitfields but EE4FAST bit) */
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    /* Update the HRTIM registers (EE4FAST bit) */
    hrtim_eecr1 |= ((pEventCfg->FastMode << 18U) & HRTIM_EECR1_EE4FAST);
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    break;
  }

  case HRTIM_EVENT_5: {
    hrtim_eecr1 &= ~(HRTIM_EECR1_EE5SRC | HRTIM_EECR1_EE5POL |
                     HRTIM_EECR1_EE5SNS | HRTIM_EECR1_EE5FAST);
    hrtim_eecr1 |= ((pEventCfg->Source << 24U) & HRTIM_EECR1_EE5SRC);
    hrtim_eecr1 |= ((pEventCfg->Polarity << 24U) & HRTIM_EECR1_EE5POL);
    hrtim_eecr1 |= ((pEventCfg->Sensitivity << 24U) & HRTIM_EECR1_EE5SNS);
    /* Update the HRTIM registers (all bitfields but EE5FAST bit) */
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    /* Update the HRTIM registers (EE5FAST bit) */
    hrtim_eecr1 |= ((pEventCfg->FastMode << 24U) & HRTIM_EECR1_EE5FAST);
    hhrtim->Instance->sCommonRegs.EECR1 = hrtim_eecr1;
    break;
  }

